-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Dec 18, 2025 at 09:35 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `satisfaction`
--

-- --------------------------------------------------------

--
-- Table structure for table `activity`
--

CREATE TABLE `activity` (
  `username` varchar(30) NOT NULL,
  `ip` int(11) NOT NULL,
  `date` date NOT NULL,
  `time` time NOT NULL,
  `user_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `complaint`
--

CREATE TABLE `complaint` (
  `complaint_id` int(11) NOT NULL,
  `IP` int(11) NOT NULL,
  `fname` varchar(30) NOT NULL,
  `lname` varchar(30) NOT NULL,
  `position` varchar(30) NOT NULL,
  `company` varchar(30) NOT NULL,
  `com_cat` varchar(30) NOT NULL,
  `relative_name` varchar(30) NOT NULL,
  `document_name` varchar(30) NOT NULL,
  `file` varchar(30) NOT NULL,
  `province` varchar(30) NOT NULL,
  `city` varchar(30) NOT NULL,
  `landline_phone` varchar(11) NOT NULL,
  `tel` varchar(11) NOT NULL,
  `email` varchar(50) NOT NULL,
  `address` varchar(150) NOT NULL,
  `comp_summary` varchar(200) NOT NULL,
  `request` varchar(100) NOT NULL,
  `start_date` varchar(50) NOT NULL,
  `end_date` varchar(50) NOT NULL,
  `reply_date` varchar(20) NOT NULL,
  `code` int(11) NOT NULL,
  `status` varchar(30) NOT NULL,
  `status_desc` varchar(150) NOT NULL,
  `security_code` int(11) NOT NULL,
  `user_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `complaint`
--

INSERT INTO `complaint` (`complaint_id`, `IP`, `fname`, `lname`, `position`, `company`, `com_cat`, `relative_name`, `document_name`, `file`, `province`, `city`, `landline_phone`, `tel`, `email`, `address`, `comp_summary`, `request`, `start_date`, `end_date`, `reply_date`, `code`, `status`, `status_desc`, `security_code`, `user_id`) VALUES
(13, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(15, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(16, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(17, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(18, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(19, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(20, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(21, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(22, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(23, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(24, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(25, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(26, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(27, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(28, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(29, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(30, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(31, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(32, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(38, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(39, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(40, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(41, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(42, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(43, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(44, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(45, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(46, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(47, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(48, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(49, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '0000-00-00', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(50, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '2024-07-26', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(51, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '2024-07-26', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(52, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '2024-07-26', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(53, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '2024-07-26', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(54, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '2024-07-26', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(55, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '2024-07-26', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(56, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '2024-07-28', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(57, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '2024-07-28', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(58, 0, '', '', '', '', '[value-7]', '', '', '../image/heineken.png', '', '', '', '', '', '', '', '', '2024-07-28', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(59, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2024-07-28', '0000-00-00', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0),
(60, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2024-07-28', '0000-00-00', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0),
(61, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2024-07-28', '0000-00-00', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0),
(62, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2024-07-28', '0000-00-00', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0),
(63, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2024-07-28', '0000-00-00', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0),
(64, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2024-07-28', '0000-00-00', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0),
(65, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2024-07-28', '0000-00-00', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0),
(66, 0, '', '', '', '', '[value-7]', '', '', '../image/ball.png', '', '', '', '', '', '', '', '', '2024-07-28', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(67, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2024-07-28', '0000-00-00', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0),
(68, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2024-07-28', '0000-00-00', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0),
(69, 0, '', '', '', '', '[value-7]', '', '', '../image/ball.jpg', '', '', '', '', '', '', '', '', '2024-07-28', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(70, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2024-07-28', '0000-00-00', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0),
(71, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2024-07-28', '0000-00-00', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0),
(72, 0, '', '', '', '', '[value-7]', '', '', '../image/logo.psd', '', '', '', '', '', '', '', '', '2024-07-28', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(73, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2024-07-28', '0000-00-00', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0),
(74, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2024-07-28', '0000-00-00', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0),
(75, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2024-07-28', '0000-00-00', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0),
(76, 0, '', '', '', '', '[value-7]', '', '', '../image/ball.jpg', '', '', '', '', '', '', '', '', '2024-07-28', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(77, 0, '', '', '', '', 'محصول', '', '', '../image/1.php', '', '', '', '', '', '', '', '', '2024-07-28', '2024-07-28', '', 0, '[value-23]', '[value-24]', 0, 0),
(78, 0, '', '', '', '', 'محصول', '', '', '../image/LOGO.png', '', '', '', '', '', '', '', '', '2024-07-28', '2024-07-28', '', 747086244, '[value-23]', '[value-24]', 0, 0),
(79, 0, '', '', '', '', 'محصول', '', '', '../image/logo (2).png', '', '', '', '', '', '', '', '', '2024-07-28', '2024-07-28', '', 739536465, '[value-23]', '[value-24]', 0, 0),
(80, 0, '', '', '', '', 'خدمات', '', '', '../image/Capture.PNG', '', '', '', '', '', '', '', '', '2024-07-29 06:08:49', '2024-07-29 06:09:18', '', 398788441, '[value-23]', '[value-24]', 0, 0),
(81, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2025-11-29 06:18:37', '[value-20]', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0),
(82, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2025-12-17 20:11:29', '[value-20]', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0),
(83, 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '2025-12-17 20:18:52', '[value-20]', '[value-21]', 0, '[value-23]', '[value-24]', 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `login_status`
--

CREATE TABLE `login_status` (
  `id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(18) NOT NULL,
  `ip` int(11) NOT NULL,
  `hostname` varchar(50) NOT NULL,
  `mack_address` varchar(50) NOT NULL,
  `date` varchar(50) NOT NULL,
  `flag` tinyint(1) NOT NULL,
  `count` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `question1`
--

CREATE TABLE `question1` (
  `id` int(11) NOT NULL,
  `desc` varchar(150) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `question1`
--

INSERT INTO `question1` (`id`, `desc`) VALUES
(1, 'کیفیت رنگ و آبکاری'),
(2, 'سهولت نصب'),
(3, 'سهولت بهره برداری با توجه به چیدمان قطعات'),
(4, 'حفاظت ها شامل فیوزها و وریستورها'),
(5, 'سیم بندی و اتصلات'),
(6, 'ویژگی های کنترل کننده مرکزی،نمایشگرها و آلارم ها'),
(7, 'وضعیت و کیفیت عملکردی محصول در دوره گارانتی'),
(8, 'نحوه بسته بندی و کیفیت آن');

-- --------------------------------------------------------

--
-- Table structure for table `question2`
--

CREATE TABLE `question2` (
  `id` int(11) NOT NULL,
  `desc` varchar(150) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `question2`
--

INSERT INTO `question2` (`id`, `desc`) VALUES
(1, '-زمان مورد انتظار برای پاسخگویی'),
(2, '-نحوه تعاملات پاسخگویی و پیگیری و کیفیت ارتباطات مسئولین فروش'),
(3, '-سطح دانش فنی و توانایی مسئولین فروش'),
(4, '-انجام به موقع تعهدات مطابق شرایط توافق شده'),
(5, '-میزان انعطاف و توانایی برآورده ساختن نیازهای جدید'),
(6, '-تبلیغات و اطلاع رسانی در خصوص محصولات و شرایط جدید'),
(7, '-میزان تنوع محصولات در جهت برطرف کردن نیازها'),
(8, '-کافی و کاربردی بودن اطلاعات درج شده بر روی محصول و کتابچه راهنما'),
(9, '-نحوه بسته بندی محصولات و شرایط تحویل'),
(10, '-انطباق محصول با انتظارات مطرح شده'),
(11, '- منصفانه بودن قیمت');

-- --------------------------------------------------------

--
-- Table structure for table `question3`
--

CREATE TABLE `question3` (
  `id` int(11) NOT NULL,
  `desc` varchar(150) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `question3`
--

INSERT INTO `question3` (`id`, `desc`) VALUES
(1, 'میزان دسترسی حسن خلق نحوه پاسخ گویی و پیگیری پروژه'),
(2, 'پیش بینی دقیق در مورد تامین و تدارکات مورد نیاز'),
(3, 'منعطف بودن در اجرای پروژه در برابر تغییر الزامات مشتری'),
(4, 'انجام تعهدات مندرج در قرارداد و برآورده سازی الزامات آن'),
(5, 'کیفیت نصب تجهیزات و اجرای پروژه خدمات مهندسی'),
(6, 'رعایت زمانبندی اعلام شده و گانت چارت پروژه'),
(7, 'میزان آگاهی، تخصص و دانش فنی عوامل اجرایی پروژه'),
(8, 'میزان رعایت کلیه قوانین عمومی،ایمنی و امنیت اطلاعات کارفرما'),
(9, 'هماهنگی و اطلاع رسانی به کارفرما در مورد انجام امور');

-- --------------------------------------------------------

--
-- Table structure for table `question4`
--

CREATE TABLE `question4` (
  `id` int(11) NOT NULL,
  `text` varchar(150) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `question4`
--

INSERT INTO `question4` (`id`, `text`) VALUES
(1, ' قابلیت دسترسی و کیفیت پاسخگویی کارشناسان فنی'),
(2, 'قابلیت دسترسی و کیفیت پاسخگویی کارشناسان پشتیبانی '),
(3, 'قیمت و هزینه های پشتیبانی و خدمات پس از فروش (تعمیرات اعزام کارشناس/آموزش)'),
(4, 'مدت زمان انتظار دریافت خدمات فنی پس از اعلام نیاز'),
(5, 'مدت زمان انتظار تعمیر پس از اعلام نیاز و ارسال تجهیزات'),
(6, ' میزان موثر بودن راهنمایی های فنی '),
(7, 'ارتباطات ،نحوه برخورد، جدیت در پاسخگویی و پیگیری خدمات پس از فروش '),
(8, 'قیمت و هزینه های پشتیبانی و خدمات پس از فروش (تعمیرات اعزام کارشناس/آموزش)');

-- --------------------------------------------------------

--
-- Table structure for table `question5`
--

CREATE TABLE `question5` (
  `ID` int(11) NOT NULL,
  `Text` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `question5`
--

INSERT INTO `question5` (`ID`, `Text`) VALUES
(1, 'اطلاع رسانی موثر در خصوص روش های شکایت'),
(2, 'سهولت دسترسی به سامانه های طرح شکایت'),
(3, 'سرعت عمل سازمان در دریافت ،بررسی و رسیدگی به شکایت'),
(4, 'نحوه برخورد مسئولین فرآیند رسیدگی به شکایات'),
(5, 'میزان رعایت تعهدات توسط شرکت در قبال رسیدگی به شکایت طرح شده'),
(6, 'نحوه اعلام نتایج رسیدگی به شکایت '),
(7, 'میزان مطلوبیت اقدامات انجام شده پیرو شکایت طرح شده');

-- --------------------------------------------------------

--
-- Table structure for table `satisfaction1`
--

CREATE TABLE `satisfaction1` (
  `id` int(11) NOT NULL,
  `name` varchar(150) NOT NULL,
  `lastname` varchar(150) NOT NULL,
  `position` varchar(150) NOT NULL,
  `comany` varchar(150) NOT NULL,
  `prodouctname` varchar(150) NOT NULL,
  `q1` varchar(150) NOT NULL,
  `q1_score` varchar(150) NOT NULL,
  `q1_important` varchar(150) NOT NULL,
  `q2` varchar(150) NOT NULL,
  `q2_score` varchar(150) NOT NULL,
  `q2_important` varchar(150) NOT NULL,
  `q3` varchar(150) NOT NULL,
  `q3_score` varchar(150) NOT NULL,
  `q_important3` varchar(150) NOT NULL,
  `q4` varchar(150) NOT NULL,
  `q_score4` varchar(150) NOT NULL,
  `q_important4` varchar(150) NOT NULL,
  `q5` varchar(150) NOT NULL,
  `q_score5` varchar(150) NOT NULL,
  `q_important5` varchar(150) NOT NULL,
  `q6` varchar(150) NOT NULL,
  `q_score6` varchar(150) NOT NULL,
  `q_important6` varchar(150) NOT NULL,
  `q7` varchar(150) NOT NULL,
  `q_score7` varchar(150) NOT NULL,
  `q_important7` varchar(150) NOT NULL,
  `q8` varchar(150) NOT NULL,
  `q_score8` varchar(150) NOT NULL,
  `q_important8` varchar(150) NOT NULL,
  `tel` varchar(150) NOT NULL,
  `start_date` varchar(50) NOT NULL,
  `end_date` varchar(50) NOT NULL,
  `IP` int(11) NOT NULL,
  `date` varchar(150) NOT NULL,
  `user_id` int(11) NOT NULL,
  `serial` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `satisfaction1`
--

INSERT INTO `satisfaction1` (`id`, `name`, `lastname`, `position`, `comany`, `prodouctname`, `q1`, `q1_score`, `q1_important`, `q2`, `q2_score`, `q2_important`, `q3`, `q3_score`, `q_important3`, `q4`, `q_score4`, `q_important4`, `q5`, `q_score5`, `q_important5`, `q6`, `q_score6`, `q_important6`, `q7`, `q_score7`, `q_important7`, `q8`, `q_score8`, `q_important8`, `tel`, `start_date`, `end_date`, `IP`, `date`, `user_id`, `serial`) VALUES
(1, '0', '0', '0', '0', '0', '[value-7]', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', 0, '0', 0, 0),
(2, '0', '0', '0', '0', '0', '[value-7]', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '2024', 0, '0', 0, 0),
(3, '0', '0', '0', '0', '0', '[value-7]', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '2024', 0, '0', 0, 0),
(4, '0', '0', '0', '0', '0', '[value-7]', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '2024', 0, '0', 0, 0),
(5, '0', '0', '0', '0', '0', '[value-7]', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '2024', 0, '0', 0, 0),
(6, '0', '0', '0', '0', '0', '[value-7]', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '2024', 0, '0', 0, 0),
(7, '0', '0', '0', '0', '0', '[value-7]', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '2024', 0, '0', 0, 0),
(8, '0', '0', '0', '0', '0', '[value-6]', '[value-7]', '[value-8]', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '0', 0, '0', 0, 0),
(9, '0', '0', '0', '0', '0', '[value-6]', '[value-7]', '[value-8]', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '0', 0, '0', 0, 0),
(10, '0', '0', '0', '0', '0', '[value-7]', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '2024', 0, '0', 0, 0),
(11, '0', '0', '0', '0', '0', '[value-7]', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '2024', 0, '0', 0, 0),
(12, '0', '0', '0', '0', '0', '[value-6]', '[value-7]', '[value-8]', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '0', 0, '0', 0, 0),
(13, '0', '0', '0', '0', '0', '[value-6]', '[value-7]', '[value-8]', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '0', 0, '0', 0, 0),
(14, '0', '0', '0', '0', '0', '[value-6]', '[value-7]', '[value-8]', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '0', 0, '0', 0, 0),
(15, '0', '0', '0', '0', '0', '[value-6]', '[value-7]', '[value-8]', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '0', 0, '0', 0, 0),
(16, '0', '0', '0', '0', '0', '[value-6]', '[value-7]', '[value-8]', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '0', 0, '0', 0, 0),
(17, '0', '0', '0', '0', '0', '[value-6]', '[value-7]', '[value-8]', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '0', 0, '0', 0, 0),
(18, '0', '0', '0', '0', '0', '[value-6]', '[value-7]', '[value-8]', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '0', 0, '0', 0, 0),
(19, '0', '0', '0', '0', '0', '[value-7]', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024-07-25 09:10:32', '2024-07-25 09:11:05', 0, '0', 0, 0),
(20, '0', '0', '0', '0', '0', '[value-7]', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024-07-25 09:11:07', '2024-07-25 09:11:08', 0, '0', 0, 0),
(21, '0', '0', '0', '0', '0', 'کیفیت رنگ و آبکاری', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024-07-25 09:12:21', '2024-07-25 09:23:20', 0, '0', 0, 0),
(22, '0', '0', '0', '0', '0', 'کیفیت رنگ و آبکاری', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024-07-25 09:24:32', '2024-07-25 09:24:35', 0, '0', 0, 0),
(23, '', '', '', '', '', 'کیفیت رنگ و آبکاری', 'عالی', 'بالا', 'سهولت نصب', 'عالی', 'بالا', 'سهولت بهره برداری با توجه به چیدمان قطعات', 'عالی', 'بالا', 'حفاظت ها شامل فیوزها و وریستورها', 'عالی', 'بالا', 'سیم بندی و اتصلات', 'عالی', 'بالا', 'ویژگی های کنترل کننده مرکزی،نمایشگرها و آلارم ها', 'عالی', 'بالا', 'وضعیت و کیفیت عملکردی محصول در دوره گارانتی', 'عالی', 'بالا', 'نحوه بسته بندی و کیفیت آن', 'عالی', 'بالا', '', '2024-07-25 09:53:24', '2024-07-25 09:53:27', 0, '', 0, 0),
(24, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-25 10:00:29', '[value-32]', 0, '[value-33]', 0, 0),
(25, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-25 12:12:17', '[value-32]', 0, '[value-33]', 0, 0),
(26, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-26 14:03:10', '[value-32]', 0, '[value-33]', 0, 0),
(27, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-26 14:04:42', '[value-32]', 0, '[value-33]', 0, 0),
(28, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-26 14:05:20', '[value-32]', 0, '[value-33]', 0, 0),
(29, '', '', '', '', '', 'کیفیت رنگ و آبکاری', 'عالی', 'بالا', 'سهولت نصب', 'عالی', 'بالا', 'سهولت بهره برداری با توجه به چیدمان قطعات', 'عالی', 'بالا', 'حفاظت ها شامل فیوزها و وریستورها', 'عالی', 'بالا', 'سیم بندی و اتصلات', 'عالی', 'بالا', 'ویژگی های کنترل کننده مرکزی،نمایشگرها و آلارم ها', 'عالی', 'بالا', 'وضعیت و کیفیت عملکردی محصول در دوره گارانتی', 'عالی', 'بالا', 'نحوه بسته بندی و کیفیت آن', 'عالی', 'بالا', '', '2024-07-26 14:16:48', '2024-07-26 14:17:21', 0, '', 0, 0),
(30, '', '', '', '', '', 'کیفیت رنگ و آبکاری', 'عالی', 'بالا', 'سهولت نصب', 'عالی', 'بالا', 'سهولت بهره برداری با توجه به چیدمان قطعات', 'عالی', 'بالا', 'حفاظت ها شامل فیوزها و وریستورها', 'عالی', 'بالا', 'سیم بندی و اتصلات', 'عالی', 'بالا', 'ویژگی های کنترل کننده مرکزی،نمایشگرها و آلارم ها', 'عالی', 'بالا', 'وضعیت و کیفیت عملکردی محصول در دوره گارانتی', 'عالی', 'بالا', 'نحوه بسته بندی و کیفیت آن', 'عالی', 'بالا', '', '2024-07-26 15:38:33', '2024-07-26 15:38:40', 0, '', 0, 0),
(31, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-26 15:38:42', '[value-32]', 0, '[value-33]', 0, 0),
(32, '', '', '', '', '', 'کیفیت رنگ و آبکاری', 'عالی', 'بالا', 'سهولت نصب', 'عالی', 'بالا', 'سهولت بهره برداری با توجه به چیدمان قطعات', 'عالی', 'بالا', 'حفاظت ها شامل فیوزها و وریستورها', 'عالی', 'بالا', 'سیم بندی و اتصلات', 'عالی', 'بالا', 'ویژگی های کنترل کننده مرکزی،نمایشگرها و آلارم ها', 'عالی', 'بالا', 'وضعیت و کیفیت عملکردی محصول در دوره گارانتی', 'عالی', 'بالا', 'نحوه بسته بندی و کیفیت آن', 'عالی', 'بالا', '', '2024-07-26 17:20:29', '2024-07-26 17:20:31', 0, '', 0, 0),
(33, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-26 17:24:28', '[value-32]', 0, '[value-33]', 0, 0),
(34, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-26 17:25:59', '[value-32]', 0, '[value-33]', 0, 0),
(35, '', '', '', '', '', 'کیفیت رنگ و آبکاری', 'عالی', 'بالا', 'سهولت نصب', 'عالی', 'بالا', 'سهولت بهره برداری با توجه به چیدمان قطعات', 'عالی', 'بالا', 'حفاظت ها شامل فیوزها و وریستورها', 'عالی', 'بالا', 'سیم بندی و اتصلات', 'عالی', 'بالا', 'ویژگی های کنترل کننده مرکزی،نمایشگرها و آلارم ها', 'عالی', 'بالا', 'وضعیت و کیفیت عملکردی محصول در دوره گارانتی', 'عالی', 'بالا', 'نحوه بسته بندی و کیفیت آن', 'عالی', 'بالا', '', '2024-07-26 17:29:02', '2024-07-26 17:31:22', 0, '', 0, 0),
(36, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-26 17:38:14', '[value-32]', 0, '[value-33]', 0, 0),
(37, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-26 18:50:26', '[value-32]', 0, '[value-33]', 0, 0),
(38, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-28 10:45:13', '[value-32]', 0, '[value-33]', 0, 550597331),
(39, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-28 10:48:02', '[value-32]', 0, '[value-33]', 0, 0),
(40, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-28 10:51:48', '[value-32]', 0, '[value-33]', 0, 0),
(41, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-28 10:52:40', '[value-32]', 0, '[value-33]', 0, 0),
(42, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-28 10:59:37', '[value-32]', 0, '[value-33]', 0, 0),
(43, '', '', '', '', '', 'کیفیت رنگ و آبکاری', 'عالی', 'بالا', 'سهولت نصب', 'عالی', 'بالا', 'سهولت بهره برداری با توجه به چیدمان قطعات', 'عالی', 'بالا', 'حفاظت ها شامل فیوزها و وریستورها', 'عالی', 'بالا', 'سیم بندی و اتصلات', 'عالی', 'بالا', 'ویژگی های کنترل کننده مرکزی،نمایشگرها و آلارم ها', 'عالی', 'بالا', 'وضعیت و کیفیت عملکردی محصول در دوره گارانتی', 'عالی', 'بالا', 'نحوه بسته بندی و کیفیت آن', 'عالی', 'بالا', '', '2024-07-28 11:03:05', '2024-07-28 11:29:16', 0, '', 0, 208061336),
(44, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-28 11:35:47', '[value-32]', 0, '[value-33]', 0, 0),
(45, '', '', '', '', '', 'کیفیت رنگ و آبکاری', 'عالی', 'بالا', 'سهولت نصب', 'عالی', 'بالا', 'سهولت بهره برداری با توجه به چیدمان قطعات', 'عالی', 'بالا', 'حفاظت ها شامل فیوزها و وریستورها', 'عالی', 'بالا', 'سیم بندی و اتصلات', 'عالی', 'بالا', 'ویژگی های کنترل کننده مرکزی،نمایشگرها و آلارم ها', 'عالی', 'بالا', 'وضعیت و کیفیت عملکردی محصول در دوره گارانتی', 'عالی', 'بالا', 'نحوه بسته بندی و کیفیت آن', 'عالی', 'بالا', '', '2024-07-29 07:18:50', '2024-07-29 07:18:53', 0, '', 0, 459983360),
(46, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-29 07:24:20', '[value-32]', 0, '[value-33]', 0, 0),
(47, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2024-07-29 09:16:30', '[value-32]', 0, '[value-33]', 0, 0),
(48, '', '', '', '', '', 'کیفیت رنگ و آبکاری', 'عالی', 'بالا', 'سهولت نصب', 'عالی', 'بالا', 'سهولت بهره برداری با توجه به چیدمان قطعات', 'عالی', 'بالا', 'حفاظت ها شامل فیوزها و وریستورها', 'عالی', 'بالا', 'سیم بندی و اتصلات', 'عالی', 'بالا', 'ویژگی های کنترل کننده مرکزی،نمایشگرها و آلارم ها', 'عالی', 'بالا', 'وضعیت و کیفیت عملکردی محصول در دوره گارانتی', 'عالی', 'بالا', 'نحوه بسته بندی و کیفیت آن', 'عالی', 'بالا', '', '2024-07-29 09:57:02', '2024-07-29 09:57:06', 0, '', 0, 629085195),
(49, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2025-11-29 06:18:49', '[value-32]', 0, '[value-33]', 0, 0),
(50, '[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '2025-12-17 20:11:24', '[value-32]', 0, '[value-33]', 0, 0),
(51, '', '', '', '', '', 'کیفیت رنگ و آبکاری', 'عالی', 'بالا', 'سهولت نصب', 'عالی', 'بالا', 'سهولت بهره برداری با توجه به چیدمان قطعات', 'عالی', 'بالا', 'حفاظت ها شامل فیوزها و وریستورها', 'عالی', 'بالا', 'سیم بندی و اتصلات', 'عالی', 'بالا', 'ویژگی های کنترل کننده مرکزی،نمایشگرها و آلارم ها', 'عالی', 'بالا', 'وضعیت و کیفیت عملکردی محصول در دوره گارانتی', 'عالی', 'بالا', 'نحوه بسته بندی و کیفیت آن', 'عالی', 'بالا', '', '2025-12-17 20:23:59', '2025-12-17 20:31:15', 0, '', 0, 213431362);

-- --------------------------------------------------------

--
-- Table structure for table `satisfaction2`
--

CREATE TABLE `satisfaction2` (
  `id` int(20) NOT NULL,
  `name` varchar(20) NOT NULL,
  `family` varchar(20) NOT NULL,
  `position` varchar(30) NOT NULL,
  `company` varchar(30) NOT NULL,
  `contact_number` int(20) NOT NULL,
  `contact_subject` varchar(25) NOT NULL,
  `question1` varchar(50) NOT NULL,
  `q_d1` varchar(5) NOT NULL,
  `q_s1` varchar(8) NOT NULL,
  `question2` varchar(50) DEFAULT NULL,
  `q_d2` varchar(5) NOT NULL,
  `q_s2` varchar(8) NOT NULL,
  `question3` varchar(50) DEFAULT NULL,
  `q_d3` varchar(5) NOT NULL,
  `q_s3` varchar(8) NOT NULL,
  `question4` varchar(50) DEFAULT NULL,
  `q_d4` varchar(5) NOT NULL,
  `q_s4` varchar(8) NOT NULL,
  `question5` varchar(50) DEFAULT NULL,
  `q_d5` varchar(5) NOT NULL,
  `q_s5` varchar(8) NOT NULL,
  `question6` varchar(50) DEFAULT NULL,
  `q_d6` varchar(5) NOT NULL,
  `q_s6` varchar(8) NOT NULL,
  `question7` varchar(50) DEFAULT NULL,
  `q_d7` varchar(5) NOT NULL,
  `q_s7` varchar(8) NOT NULL,
  `question8` varchar(50) DEFAULT NULL,
  `q_d8` varchar(5) NOT NULL,
  `q_s8` varchar(8) NOT NULL,
  `question9` varchar(50) DEFAULT NULL,
  `q_d9` varchar(5) NOT NULL,
  `q_s9` varchar(8) NOT NULL,
  `question10` varchar(50) DEFAULT NULL,
  `q_d10` varchar(5) NOT NULL,
  `q_s10` varchar(8) NOT NULL,
  `question11` varchar(50) DEFAULT NULL,
  `q_d11` varchar(5) NOT NULL,
  `q_s11` varchar(8) NOT NULL,
  `phone_number` int(11) NOT NULL,
  `name_date` varchar(25) NOT NULL,
  `start_date` varchar(50) DEFAULT NULL,
  `end_data` varchar(50) DEFAULT NULL,
  `ip` int(11) DEFAULT NULL,
  `user_id` int(11) NOT NULL,
  `serial` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `satisfaction2`
--

INSERT INTO `satisfaction2` (`id`, `name`, `family`, `position`, `company`, `contact_number`, `contact_subject`, `question1`, `q_d1`, `q_s1`, `question2`, `q_d2`, `q_s2`, `question3`, `q_d3`, `q_s3`, `question4`, `q_d4`, `q_s4`, `question5`, `q_d5`, `q_s5`, `question6`, `q_d6`, `q_s6`, `question7`, `q_d7`, `q_s7`, `question8`, `q_d8`, `q_s8`, `question9`, `q_d9`, `q_s9`, `question10`, `q_d10`, `q_s10`, `question11`, `q_d11`, `q_s11`, `phone_number`, `name_date`, `start_date`, `end_data`, `ip`, `user_id`, `serial`) VALUES
(40, '', '', '', '', 0, '', ' -زمان مورد انتظار برای پاسخگویی', 'بالا', 'عالی', ' -نحوه تعاملات پاسخگویی و پیگیری و کیفیت ارتباطات ', 'بالا', 'عالی', ' -سطح دانش فنی و توانایی مسئولین فروش', 'بالا', 'عالی', ' -انجام به موقع تعهدات مطابق شرایط توافق شده', 'بالا', 'عالی', ' -میزان انعطاف و توانایی برآورده ساختن نیازهای جدی', 'بالا', 'عالی', ' -تبلیغات و اطلاع رسانی در خصوص محصولات و شرایط جد', 'بالا', 'عالی', ' -میزان تنوع محصولات در جهت برطرف کردن نیازها', 'بالا', 'عالی', ' -کافی و کاربردی بودن اطلاعات درج شده بر روی محصول', 'بالا', 'عالی', ' -نحوه بسته بندی محصولات و شرایط تحویل', 'بالا', 'عالی', ' -انطباق محصول با انتظارات مطرح شده', 'بالا', 'عالی', ' - منصفانه بودن قیمت', 'بالا', 'عالی', 0, '', '2024-07-25 10:00:32', '2024-07-25 10:00:35', NULL, 0, 0),
(41, '[value-1]', '[value-2]', '[value-3]', '[value-4]', 0, '[value-6]', '[value-7]', '[valu', '[value-9', '[value-10]', '[valu', '[value-1', '[value-13]', '[valu', '[value-1', '[value-16]', '[valu', '[value-1', '[value-19]', '[valu', '[value-2', '[value-22]', '[valu', '[value-2', '[value-25]', '[valu', '[value-2', '[value-28]', '[valu', '[value-3', '[value-31]', '[valu', '[value-3', '[value-34]', '[valu', '[value-3', '[value-37]', '[valu', '[value-3', 0, '[value-41]', '2024-07-25 10:13:34', '[value-43]', NULL, 0, 0),
(42, '[value-1]', '[value-2]', '[value-3]', '[value-4]', 0, '[value-6]', '[value-7]', '[valu', '[value-9', '[value-10]', '[valu', '[value-1', '[value-13]', '[valu', '[value-1', '[value-16]', '[valu', '[value-1', '[value-19]', '[valu', '[value-2', '[value-22]', '[valu', '[value-2', '[value-25]', '[valu', '[value-2', '[value-28]', '[valu', '[value-3', '[value-31]', '[valu', '[value-3', '[value-34]', '[valu', '[value-3', '[value-37]', '[valu', '[value-3', 0, '[value-41]', '2024-07-25 12:13:09', '[value-43]', NULL, 0, 0),
(43, '', '', '', '', 0, '', ' -زمان مورد انتظار برای پاسخگویی', 'بالا', 'عالی', ' -نحوه تعاملات پاسخگویی و پیگیری و کیفیت ارتباطات ', 'بالا', 'عالی', ' -سطح دانش فنی و توانایی مسئولین فروش', 'بالا', 'عالی', ' -انجام به موقع تعهدات مطابق شرایط توافق شده', 'بالا', 'عالی', ' -میزان انعطاف و توانایی برآورده ساختن نیازهای جدی', 'بالا', 'عالی', ' -تبلیغات و اطلاع رسانی در خصوص محصولات و شرایط جد', 'بالا', 'عالی', ' -میزان تنوع محصولات در جهت برطرف کردن نیازها', 'بالا', 'عالی', ' -کافی و کاربردی بودن اطلاعات درج شده بر روی محصول', 'بالا', 'عالی', ' -نحوه بسته بندی محصولات و شرایط تحویل', 'بالا', 'عالی', ' -انطباق محصول با انتظارات مطرح شده', 'بالا', 'عالی', ' - منصفانه بودن قیمت', 'بالا', 'عالی', 0, '', '2024-07-28 11:35:51', '2024-07-28 11:37:35', NULL, 0, 907541172),
(44, '[value-1]', '[value-2]', '[value-3]', '[value-4]', 0, '[value-6]', '[value-7]', '[valu', '[value-9', '[value-10]', '[valu', '[value-1', '[value-13]', '[valu', '[value-1', '[value-16]', '[valu', '[value-1', '[value-19]', '[valu', '[value-2', '[value-22]', '[valu', '[value-2', '[value-25]', '[valu', '[value-2', '[value-28]', '[valu', '[value-3', '[value-31]', '[valu', '[value-3', '[value-34]', '[valu', '[value-3', '[value-37]', '[valu', '[value-3', 0, '[value-41]', '2024-07-28 11:39:54', '[value-43]', NULL, 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `satisfaction3`
--

CREATE TABLE `satisfaction3` (
  `name` varchar(200) NOT NULL,
  `family` varchar(200) NOT NULL,
  `position` varchar(200) NOT NULL,
  `campany` varchar(200) NOT NULL,
  `number` varchar(200) NOT NULL,
  `subject` varchar(200) NOT NULL,
  `question1` varchar(150) NOT NULL,
  `q_d1` varchar(150) NOT NULL,
  `q_s1` varchar(150) NOT NULL,
  `question2` varchar(150) NOT NULL,
  `q_d2` varchar(150) NOT NULL,
  `q_s2` varchar(150) NOT NULL,
  `question3` varchar(150) NOT NULL,
  `q_d3` varchar(150) NOT NULL,
  `q_s3` varchar(150) NOT NULL,
  `question4` varchar(150) NOT NULL,
  `q_d4` varchar(150) NOT NULL,
  `q_s4` varchar(150) NOT NULL,
  `question5` varchar(150) NOT NULL,
  `q_d5` varchar(150) NOT NULL,
  `q_s5` varchar(150) NOT NULL,
  `question6` varchar(150) NOT NULL,
  `q_d6` varchar(150) NOT NULL,
  `q_s6` varchar(150) NOT NULL,
  `question7` varchar(150) NOT NULL,
  `q_d7` varchar(150) NOT NULL,
  `q_s7` varchar(150) NOT NULL,
  `question8` varchar(150) NOT NULL,
  `q_d8` varchar(150) NOT NULL,
  `q_s8` varchar(150) NOT NULL,
  `question9` varchar(150) NOT NULL,
  `q_d9` varchar(150) NOT NULL,
  `q_s9` varchar(150) NOT NULL,
  `start_date` varchar(150) NOT NULL,
  `end_date` varchar(150) NOT NULL,
  `ip` int(11) NOT NULL,
  `id` int(11) NOT NULL,
  `date` text NOT NULL,
  `phonenumber` varchar(12) NOT NULL,
  `user_id` int(11) NOT NULL,
  `serial` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `satisfaction3`
--

INSERT INTO `satisfaction3` (`name`, `family`, `position`, `campany`, `number`, `subject`, `question1`, `q_d1`, `q_s1`, `question2`, `q_d2`, `q_s2`, `question3`, `q_d3`, `q_s3`, `question4`, `q_d4`, `q_s4`, `question5`, `q_d5`, `q_s5`, `question6`, `q_d6`, `q_s6`, `question7`, `q_d7`, `q_s7`, `question8`, `q_d8`, `q_s8`, `question9`, `q_d9`, `q_s9`, `start_date`, `end_date`, `ip`, `id`, `date`, `phonenumber`, `user_id`, `serial`) VALUES
('', '', '', '', '', '', '[value-7]', 'بالا', 'عالی', '[value-10]', 'بالا', 'عالی', '[value-13]', 'بالا', 'عالی', '[value-16]', 'بالا', 'عالی', '[value-19]', 'بالا', 'عالی', '[value-22]', 'بالا', 'عالی', '[value-25]', 'بالا', 'عالی', '[value-28]', 'بالا', 'عالی', '[value-31]', 'بالا', 'عالی', '2024-07-24 13:08:51', '2024-07-24 13:08:55', 0, 18, '', '', 0, 0),
('', '', '', '', '', '', '[value-7]', 'بالا', 'عالی', '[value-10]', 'بالا', 'عالی', '[value-13]', 'بالا', 'عالی', '[value-16]', 'بالا', 'عالی', '[value-19]', 'بالا', 'عالی', '[value-22]', 'بالا', 'عالی', '[value-25]', 'بالا', 'عالی', '[value-28]', 'بالا', 'عالی', '[value-31]', 'بالا', 'عالی', '2024-07-24 13:08:58', '2024-07-24 13:08:59', 0, 19, '', '', 0, 0),
('[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '[value-31]', '[value-32]', '[value-33]', '2024-07-24 13:10:21', '[value-35]', 0, 20, '[value-36]', '[value-37]', 0, 0),
('[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '[value-31]', '[value-32]', '[value-33]', '2024-07-24 14:06:29', '[value-35]', 0, 21, '[value-36]', '[value-37]', 0, 0),
('', '', '', '', '', '', 'بالا', 'بالا', 'عالی', 'بالا', 'بالا', 'عالی', 'بالا', 'بالا', 'عالی', 'بالا', 'بالا', 'عالی', 'بالا', 'بالا', 'عالی', 'بالا', 'بالا', 'عالی', 'بالا', 'بالا', 'عالی', 'بالا', 'بالا', 'عالی', 'بالا', 'بالا', 'عالی', '2024-07-25 10:15:44', '2024-07-25 10:15:46', 0, 22, '', '', 0, 0),
('', '', '', '', '', '', 'بالا', 'بالا', 'عالی', 'بالا', 'بالا', 'عالی', 'بالا', 'بالا', 'عالی', 'بالا', 'بالا', 'عالی', 'بالا', 'بالا', 'عالی', 'بالا', 'بالا', 'عالی', 'بالا', 'بالا', 'عالی', 'بالا', 'بالا', 'عالی', 'بالا', 'بالا', 'عالی', '2024-07-25 10:16:23', '2024-07-25 10:16:26', 0, 23, '', '', 0, 0),
('', '', '', '', '', '', 'میزان دسترسی حسن خلق نحوه پاسخ گویی و پیگیری پروژه', 'بالا', 'عالی', 'پیش بینی دقیق در مورد تامین و تدارکات مورد نیاز', 'بالا', 'عالی', 'منعطف بودن در اجرای پروژه در برابر تغییر الزامات مشتری', 'بالا', 'عالی', 'انجام تعهدات مندرج در قرارداد و برآورده سازی الزامات آن', 'بالا', 'عالی', 'کیفیت نصب تجهیزات و اجرای پروژه خدمات مهندسی', 'بالا', 'عالی', 'رعایت زمانبندی اعلام شده و گانت چارت پروژه', 'بالا', 'عالی', 'میزان آگاهی، تخصص و دانش فنی عوامل اجرایی پروژه', 'بالا', 'عالی', 'میزان رعایت کلیه قوانین عمومی،ایمنی و امنیت اطلاعات کارفرما', 'بالا', 'عالی', 'هماهنگی و اطلاع رسانی به کارفرما در مورد انجام امور', 'بالا', 'عالی', '2024-07-25 10:19:35', '2024-07-25 10:19:38', 0, 24, '', '', 0, 0),
('[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '[value-31]', '[value-32]', '[value-33]', '2024-07-25 10:24:31', '[value-35]', 0, 25, '[value-36]', '[value-37]', 0, 0),
('', '', '', '', '', '', 'میزان دسترسی حسن خلق نحوه پاسخ گویی و پیگیری پروژه', 'بالا', 'عالی', 'پیش بینی دقیق در مورد تامین و تدارکات مورد نیاز', 'بالا', 'عالی', 'منعطف بودن در اجرای پروژه در برابر تغییر الزامات مشتری', 'بالا', 'عالی', 'انجام تعهدات مندرج در قرارداد و برآورده سازی الزامات آن', 'بالا', 'عالی', 'کیفیت نصب تجهیزات و اجرای پروژه خدمات مهندسی', 'بالا', 'عالی', 'رعایت زمانبندی اعلام شده و گانت چارت پروژه', 'بالا', 'عالی', 'میزان آگاهی، تخصص و دانش فنی عوامل اجرایی پروژه', 'بالا', 'عالی', 'میزان رعایت کلیه قوانین عمومی،ایمنی و امنیت اطلاعات کارفرما', 'بالا', 'عالی', 'هماهنگی و اطلاع رسانی به کارفرما در مورد انجام امور', 'بالا', 'عالی', '2024-07-28 11:39:58', '2024-07-28 11:40:01', 0, 26, '', '', 0, 496396971),
('[value-1]', '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '[value-31]', '[value-32]', '[value-33]', '2024-07-28 11:41:14', '[value-35]', 0, 27, '[value-36]', '[value-37]', 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `satisfaction4`
--

CREATE TABLE `satisfaction4` (
  `id` int(11) NOT NULL,
  `name` varchar(150) NOT NULL,
  `lastname` varchar(150) NOT NULL,
  `position` varchar(150) NOT NULL,
  `comany` varchar(150) NOT NULL,
  `prodouctname` varchar(150) NOT NULL,
  `q1` varchar(150) NOT NULL,
  `q1_score` varchar(150) NOT NULL,
  `q1_important` varchar(150) NOT NULL,
  `q2` varchar(150) NOT NULL,
  `q2_score` varchar(150) NOT NULL,
  `q2_important` varchar(150) NOT NULL,
  `q3` varchar(150) NOT NULL,
  `q3_score` varchar(150) NOT NULL,
  `q_important3` varchar(150) NOT NULL,
  `q4` varchar(150) NOT NULL,
  `q_score4` varchar(150) NOT NULL,
  `q_important4` varchar(150) NOT NULL,
  `q5` varchar(150) NOT NULL,
  `q_score5` varchar(150) NOT NULL,
  `q_important5` varchar(150) NOT NULL,
  `q6` varchar(150) NOT NULL,
  `q_score6` varchar(150) NOT NULL,
  `q_important6` varchar(150) NOT NULL,
  `q7` varchar(150) NOT NULL,
  `q_score7` varchar(150) NOT NULL,
  `q_important7` varchar(150) NOT NULL,
  `q8` varchar(150) NOT NULL,
  `q_score8` varchar(150) NOT NULL,
  `q_important8` varchar(150) NOT NULL,
  `tel` varchar(150) NOT NULL,
  `start_date` varchar(50) NOT NULL,
  `end_date` varchar(50) NOT NULL,
  `IP` int(11) NOT NULL,
  `date` varchar(150) NOT NULL,
  `user_id` int(11) NOT NULL,
  `serial` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `satisfaction4`
--

INSERT INTO `satisfaction4` (`id`, `name`, `lastname`, `position`, `comany`, `prodouctname`, `q1`, `q1_score`, `q1_important`, `q2`, `q2_score`, `q2_important`, `q3`, `q3_score`, `q_important3`, `q4`, `q_score4`, `q_important4`, `q5`, `q_score5`, `q_important5`, `q6`, `q_score6`, `q_important6`, `q7`, `q_score7`, `q_important7`, `q8`, `q_score8`, `q_important8`, `tel`, `start_date`, `end_date`, `IP`, `date`, `user_id`, `serial`) VALUES
(33, '0', '0', '0', '0', '0', '[value-7]', '[value-8]', '[value-9]', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '0', 0, '0', 0, 0),
(34, '0', '0', '0', '0', '0', '[value-7]', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '2024', 0, '0', 0, 0),
(35, '0', '0', '0', '0', '0', '[value-7]', '[value-8]', '[value-9]', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '0', 0, '0', 0, 0),
(36, '0', '0', '0', '0', '0', '[value-7]', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '2024', 0, '0', 0, 0),
(37, '0', '0', '0', '0', '0', '[value-7]', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '2024', 0, '0', 0, 0),
(38, '0', '0', '0', '0', '0', '[value-7]', '[value-8]', '[value-9]', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '0', 0, '0', 0, 0),
(39, '0', '0', '0', '0', '0', '[value-7]', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '2024', 0, '0', 0, 0),
(40, '0', '0', '0', '0', '0', '[value-7]', '[value-8]', '[value-9]', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '0', 0, '0', 0, 0),
(41, '0', '0', '0', '0', '0', '[value-7]', '[value-8]', '[value-9]', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024', '0', 0, '0', 0, 0),
(42, '0', '0', '0', '0', '0', '[value-7]', '[value-8]', '[value-9]', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024-07-25 10:24:33', '[value-33]', 0, '0', 0, 0),
(43, '0', '0', '0', '0', '0', ' قابلیت دسترسی و کیفیت پاسخگویی کارشناسان فنی', 'عالی', 'بالا', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '2024-07-25 10:25:09', '2024-07-25 10:25:11', 0, '0', 0, 0),
(44, '', '', '', '', '', ' قابلیت دسترسی و کیفیت پاسخگویی کارشناسان فنی', 'عالی', 'بالا', 'قابلیت دسترسی و کیفیت پاسخگویی کارشناسان پشتیبانی ', 'عالی', 'بالا', 'قیمت و هزینه های پشتیبانی و خدمات پس از فروش (تعمیرات اعزام کارشناس/آموزش)', 'عالی', 'بالا', 'مدت زمان انتظار دریافت خدمات فنی پس از اعلام نیاز', 'عالی', 'بالا', 'مدت زمان انتظار تعمیر پس از اعلام نیاز و ارسال تجهیزات', 'عالی', 'بالا', ' میزان موثر بودن راهنمایی های فنی ', 'عالی', 'بالا', 'ارتباطات ،نحوه برخورد، جدیت در پاسخگویی و پیگیری خدمات پس از فروش ', 'عالی', 'بالا', 'قیمت و هزینه های پشتیبانی و خدمات پس از فروش (تعمیرات اعزام کارشناس/آموزش)', 'عالی', 'بالا', '', '2024-07-25 10:36:42', '2024-07-25 10:36:45', 0, '', 0, 0),
(45, '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '[value-31]', '2024-07-25 10:42:03', '[value-33]', 0, '[value-35]', 0, 0),
(46, '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '[value-31]', '2024-07-25 12:10:05', '[value-33]', 0, '[value-35]', 0, 0),
(47, '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '[value-31]', '2024-07-25 12:12:02', '[value-33]', 0, '[value-35]', 0, 0),
(48, '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '[value-31]', '2024-07-25 12:12:03', '[value-33]', 0, '[value-35]', 0, 0),
(49, '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '[value-31]', '2024-07-25 12:12:07', '[value-33]', 0, '[value-35]', 0, 0),
(50, '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '[value-31]', '2024-07-25 12:12:07', '[value-33]', 0, '[value-35]', 0, 0),
(51, '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '[value-31]', '2024-07-25 12:14:13', '[value-33]', 0, '[value-35]', 0, 0),
(52, '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '[value-31]', '2024-07-25 12:14:35', '[value-33]', 0, '[value-35]', 0, 0),
(53, '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '[value-31]', '2024-07-25 12:15:17', '[value-33]', 0, '[value-35]', 0, 0),
(54, '', '', '', '', '', ' قابلیت دسترسی و کیفیت پاسخگویی کارشناسان فنی', 'عالی', 'بالا', 'قابلیت دسترسی و کیفیت پاسخگویی کارشناسان پشتیبانی ', 'عالی', 'بالا', 'قیمت و هزینه های پشتیبانی و خدمات پس از فروش (تعمیرات اعزام کارشناس/آموزش)', 'عالی', 'بالا', 'مدت زمان انتظار دریافت خدمات فنی پس از اعلام نیاز', 'عالی', 'بالا', 'مدت زمان انتظار تعمیر پس از اعلام نیاز و ارسال تجهیزات', 'عالی', 'بالا', ' میزان موثر بودن راهنمایی های فنی ', 'عالی', 'بالا', 'ارتباطات ،نحوه برخورد، جدیت در پاسخگویی و پیگیری خدمات پس از فروش ', 'عالی', 'بالا', 'قیمت و هزینه های پشتیبانی و خدمات پس از فروش (تعمیرات اعزام کارشناس/آموزش)', 'عالی', 'بالا', '', '2024-07-28 11:41:19', '2024-07-28 11:41:21', 0, '', 0, 821037159),
(55, '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-12]', '[value-13]', '[value-14]', '[value-15]', '[value-16]', '[value-17]', '[value-18]', '[value-19]', '[value-20]', '[value-21]', '[value-22]', '[value-23]', '[value-24]', '[value-25]', '[value-26]', '[value-27]', '[value-28]', '[value-29]', '[value-30]', '[value-31]', '2024-07-28 11:42:23', '[value-33]', 0, '[value-35]', 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `satisfaction5`
--

CREATE TABLE `satisfaction5` (
  `ID` int(11) NOT NULL,
  `Start_Date` varchar(50) NOT NULL,
  `End_Date` varchar(50) NOT NULL,
  `IP` int(11) NOT NULL,
  `Fname` varchar(30) NOT NULL,
  `Lname` varchar(30) NOT NULL,
  `Position` varchar(20) NOT NULL,
  `Company` varchar(20) NOT NULL,
  `Subject` varchar(30) NOT NULL,
  `Code` varchar(20) NOT NULL,
  `Tel` varchar(12) NOT NULL,
  `Date` text NOT NULL,
  `Q1` text NOT NULL,
  `Q1_E` varchar(8) NOT NULL,
  `Q1_D` varchar(5) NOT NULL,
  `Q2` text NOT NULL,
  `Q2_E` varchar(8) NOT NULL,
  `Q2_D` varchar(5) NOT NULL,
  `Q3` text NOT NULL,
  `Q3_E` varchar(8) NOT NULL,
  `Q3_D` varchar(5) NOT NULL,
  `Q4` text NOT NULL,
  `Q4_E` varchar(8) NOT NULL,
  `Q4_D` varchar(5) NOT NULL,
  `Q5` text NOT NULL,
  `Q5_E` varchar(8) NOT NULL,
  `Q5_D` varchar(5) NOT NULL,
  `Q6` text NOT NULL,
  `Q6_E` varchar(8) NOT NULL,
  `Q6_D` varchar(5) NOT NULL,
  `Q7` text NOT NULL,
  `Q7_E` varchar(8) NOT NULL,
  `Q7_D` varchar(5) NOT NULL,
  `user_id` int(11) NOT NULL,
  `serial` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `satisfaction5`
--

INSERT INTO `satisfaction5` (`ID`, `Start_Date`, `End_Date`, `IP`, `Fname`, `Lname`, `Position`, `Company`, `Subject`, `Code`, `Tel`, `Date`, `Q1`, `Q1_E`, `Q1_D`, `Q2`, `Q2_E`, `Q2_D`, `Q3`, `Q3_E`, `Q3_D`, `Q4`, `Q4_E`, `Q4_D`, `Q5`, `Q5_E`, `Q5_D`, `Q6`, `Q6_E`, `Q6_D`, `Q7`, `Q7_E`, `Q7_D`, `user_id`, `serial`) VALUES
(3, '0000-00-00', '0000-00-00', 0, 'زینب', 'صانعی', 'njhjh', 'قبلقبلفبفلقبب', 'یسیسیششسیسیسی', '446987', '09688773', 'vfgfgg', '', 'عالی', 'بالا', '', 'خیلی ضعی', 'بالا', '', 'ضعیف', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'متوسط', 'بالا', '', 'عالی', 'متوسط', 0, 0),
(15, '0000-00-00', '0000-00-00', 0, '', '', '', '', '', '', '', '', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', 0, 0),
(16, '0000-00-00', '0000-00-00', 0, '', '', '', '', '', '', '', '', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', 0, 0),
(17, '0000-00-00', '0000-00-00', 0, '', '', '', '', '', '', '', '', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', 0, 0),
(18, '0000-00-00', '0000-00-00', 0, '', '', '', '', '', '', '', '', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', 0, 0),
(19, '0000-00-00', '0000-00-00', 0, '', '', '', '', '', '', '', '', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', '', 'عالی', 'بالا', 0, 0),
(20, '2024-07-24', '2024-07-24', 0, '', '', '', '', '', '', '', '', '[value-13]', 'عالی', 'بالا', '[value-16]', 'عالی', 'بالا', '[value-19]', 'عالی', 'بالا', '[value-22]', 'عالی', 'بالا', '[value-25]', 'عالی', 'بالا', '[value-28]', 'عالی', 'بالا', '[value-31]', 'عالی', 'بالا', 0, 0),
(21, '2024-07-24', '2024-07-24', 0, '', '', '', '', '', '', '', '', '[value-13]', 'عالی', 'بالا', '[value-16]', 'عالی', 'بالا', '[value-19]', 'عالی', 'بالا', '[value-22]', 'عالی', 'بالا', '[value-25]', 'عالی', 'بالا', '[value-28]', 'عالی', 'بالا', '[value-31]', 'عالی', 'بالا', 0, 0),
(22, '2024-07-24', '0000-00-00', 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-1', '[valu', '[value-14]', '[value-1', '[valu', '[value-17]', '[value-1', '[valu', '[value-20]', '[value-2', '[valu', '[value-23]', '[value-2', '[valu', '[value-26]', '[value-2', '[valu', '[value-29]', '[value-3', '[valu', 0, 0),
(23, '2024-07-25 10:43:23', '2024-07-25 10:47:15', 0, '', '', '', '', '', '', '', '', ' ', 'عالی', 'بالا', ' ', 'عالی', 'بالا', ' ', 'عالی', 'بالا', ' ', 'عالی', 'بالا', ' ', 'عالی', 'بالا', ' ', 'عالی', 'بالا', ' ', 'عالی', 'بالا', 0, 0),
(24, '2024-07-25 10:47:17', '2024-07-25 10:47:20', 0, '', '', '', '', '', '', '', '', ' اطلاع رسانی موثر در خصوص روش های شکایت', 'عالی', 'بالا', ' سهولت دسترسی به سامانه های طرح شکایت', 'عالی', 'بالا', ' سرعت عمل سازمان در دریافت ،بررسی و رسیدگی به شکایت', 'عالی', 'بالا', ' نحوه برخورد مسئولین فرآیند رسیدگی به شکایات', 'عالی', 'بالا', ' میزان رعایت تعهدات توسط شرکت در قبال رسیدگی به شکایت طرح شده', 'عالی', 'بالا', ' نحوه اعلام نتایج رسیدگی به شکایت ', 'عالی', 'بالا', ' میزان مطلوبیت اقدامات انجام شده پیرو شکایت طرح شده', 'عالی', 'بالا', 0, 0),
(25, '2024-07-25 12:06:13', '[value-2]', 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-1', '[valu', '[value-14]', '[value-1', '[valu', '[value-17]', '[value-1', '[valu', '[value-20]', '[value-2', '[valu', '[value-23]', '[value-2', '[valu', '[value-26]', '[value-2', '[valu', '[value-29]', '[value-3', '[valu', 0, 0),
(26, '2024-07-28 11:42:25', '2024-07-28 11:47:17', 0, '', '', '', '', '', '', '', '', ' اطلاع رسانی موثر در خصوص روش های شکایت', 'عالی', 'بالا', ' سهولت دسترسی به سامانه های طرح شکایت', 'عالی', 'بالا', ' سرعت عمل سازمان در دریافت ،بررسی و رسیدگی به شکایت', 'عالی', 'بالا', ' نحوه برخورد مسئولین فرآیند رسیدگی به شکایات', 'عالی', 'بالا', ' میزان رعایت تعهدات توسط شرکت در قبال رسیدگی به شکایت طرح شده', 'عالی', 'بالا', ' نحوه اعلام نتایج رسیدگی به شکایت ', 'عالی', 'بالا', ' میزان مطلوبیت اقدامات انجام شده پیرو شکایت طرح شده', 'عالی', 'بالا', 0, 291810617),
(27, '2025-12-17 20:18:58', '[value-2]', 0, '[value-3]', '[value-4]', '[value-5]', '[value-6]', '[value-7]', '[value-8]', '[value-9]', '[value-10]', '[value-11]', '[value-1', '[valu', '[value-14]', '[value-1', '[valu', '[value-17]', '[value-1', '[valu', '[value-20]', '[value-2', '[valu', '[value-23]', '[value-2', '[valu', '[value-26]', '[value-2', '[valu', '[value-29]', '[value-3', '[valu', 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `satisfaction_category`
--

CREATE TABLE `satisfaction_category` (
  `cat_id` int(11) NOT NULL,
  `title` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `satisfaction_category`
--

INSERT INTO `satisfaction_category` (`cat_id`, `title`) VALUES
(1, 'رضایت'),
(2, 'شکایت');

-- --------------------------------------------------------

--
-- Table structure for table `suggestion`
--

CREATE TABLE `suggestion` (
  `id` int(11) NOT NULL,
  `IP` int(11) NOT NULL,
  `name` varchar(30) NOT NULL,
  `company` varchar(30) NOT NULL,
  `tel` varchar(11) NOT NULL,
  `email` varchar(20) NOT NULL,
  `text` text NOT NULL,
  `start_date` varchar(50) NOT NULL,
  `end_date` varchar(50) NOT NULL,
  `code` int(11) NOT NULL,
  `status` varchar(30) NOT NULL,
  `status_desc` varchar(150) NOT NULL,
  `security_code` int(11) NOT NULL,
  `user_id` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `suggestion`
--

INSERT INTO `suggestion` (`id`, `IP`, `name`, `company`, `tel`, `email`, `text`, `start_date`, `end_date`, `code`, `status`, `status_desc`, `security_code`, `user_id`) VALUES
(1, 0, '', '', '', '', '', '0000-00-00', '0000-00-00', 0, '', '', 0, 0),
(2, 0, '', '', '', '', '', '0000-00-00', '0000-00-00', 0, '', '', 0, 0),
(3, 0, '', '', '', '', '', '0000-00-00', '0000-00-00', 0, '', '', 0, 0),
(4, 0, '', '', '', '', '', '0000-00-00', '0000-00-00', 0, '', '', 0, 0),
(5, 0, '', '', '', '', '', '0000-00-00', '0000-00-00', 0, '', '', 0, 0),
(6, 0, '', '', '', '', '', '0000-00-00', '0000-00-00', 0, '', '', 0, 0),
(7, 0, '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '2024-07-28', '0000-00-00', 0, '[value-10]', '[value-11]', 0, 0),
(8, 0, '', ' ', ' ', '', ' ', '2024-07-28', '2024-07-28', 458002149, '[value-11]', '[value-12]', 0, 0),
(9, 0, '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '2025-11-29 06:18:23', '[value-8]', 0, '[value-10]', '[value-11]', 0, 0),
(10, 0, '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '2025-11-29 06:18:31', '[value-8]', 0, '[value-10]', '[value-11]', 0, 0),
(11, 0, '[value-2]', '[value-3]', '[value-4]', '[value-5]', '[value-6]', '2025-12-17 20:18:47', '[value-8]', 0, '[value-10]', '[value-11]', 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `suggestion_category`
--

CREATE TABLE `suggestion_category` (
  `id` int(11) NOT NULL,
  `title` varchar(30) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `username` varchar(30) NOT NULL,
  `password` varchar(18) NOT NULL,
  `fname` varchar(30) NOT NULL,
  `lname` varchar(30) NOT NULL,
  `tel` varchar(11) NOT NULL,
  `email` varchar(30) NOT NULL,
  `company` varchar(30) NOT NULL,
  `ip` int(11) NOT NULL,
  `flag` tinyint(1) NOT NULL,
  `user_id` int(11) NOT NULL,
  `login_flag` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`username`, `password`, `fname`, `lname`, `tel`, `email`, `company`, `ip`, `flag`, `user_id`, `login_flag`) VALUES
('admin', '1234', 'admin', 'admin', '', '', '', 0, 0, 0, 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `activity`
--
ALTER TABLE `activity`
  ADD PRIMARY KEY (`username`);

--
-- Indexes for table `complaint`
--
ALTER TABLE `complaint`
  ADD PRIMARY KEY (`complaint_id`);

--
-- Indexes for table `login_status`
--
ALTER TABLE `login_status`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `question1`
--
ALTER TABLE `question1`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `question2`
--
ALTER TABLE `question2`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `question3`
--
ALTER TABLE `question3`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `question4`
--
ALTER TABLE `question4`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `question5`
--
ALTER TABLE `question5`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `satisfaction1`
--
ALTER TABLE `satisfaction1`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `satisfaction2`
--
ALTER TABLE `satisfaction2`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `satisfaction3`
--
ALTER TABLE `satisfaction3`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `satisfaction4`
--
ALTER TABLE `satisfaction4`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `satisfaction5`
--
ALTER TABLE `satisfaction5`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `satisfaction_category`
--
ALTER TABLE `satisfaction_category`
  ADD PRIMARY KEY (`cat_id`);

--
-- Indexes for table `suggestion`
--
ALTER TABLE `suggestion`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `suggestion_category`
--
ALTER TABLE `suggestion_category`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`username`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `complaint`
--
ALTER TABLE `complaint`
  MODIFY `complaint_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=84;

--
-- AUTO_INCREMENT for table `login_status`
--
ALTER TABLE `login_status`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=40;

--
-- AUTO_INCREMENT for table `question1`
--
ALTER TABLE `question1`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `question2`
--
ALTER TABLE `question2`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `question3`
--
ALTER TABLE `question3`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `question4`
--
ALTER TABLE `question4`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `question5`
--
ALTER TABLE `question5`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `satisfaction1`
--
ALTER TABLE `satisfaction1`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;

--
-- AUTO_INCREMENT for table `satisfaction2`
--
ALTER TABLE `satisfaction2`
  MODIFY `id` int(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=45;

--
-- AUTO_INCREMENT for table `satisfaction3`
--
ALTER TABLE `satisfaction3`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `satisfaction4`
--
ALTER TABLE `satisfaction4`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;

--
-- AUTO_INCREMENT for table `satisfaction5`
--
ALTER TABLE `satisfaction5`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `satisfaction_category`
--
ALTER TABLE `satisfaction_category`
  MODIFY `cat_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `suggestion`
--
ALTER TABLE `suggestion`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `suggestion_category`
--
ALTER TABLE `suggestion_category`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
